import java.util.Scanner;
public class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите 3 целых числа (a, b, c):");
        int a = sc.nextInt();
        int b = sc.nextInt();
        int c = sc.nextInt();
        String p1 = ""; //,p2,p3;
//        p1 = p2 = p3 = "";

        if(a == b && b == c){
            System.out.println("Все три числа равны (" + a + ")");
        }else{//как минимум, 2 числа не равны
//            if(b < a){
//                //a - сред, b - мин
//                if(a > c){
//                    // a - макс, c - сред
//                    p3 = "a - макс (" + a + ")";
//                    if(c < b){
//                        // c - мин, b - сред
//                        p1 = "с - мин (" + c + ")";
//                        p2 = "b - сред (" + b + ")";
//                    }else//b <= c
//                        p1 = b == c ? "b и c равны (" + c + ")" : "b - мин (" + b + ")\nc - сред (" + c + ")";
//                }else{ // a <= c
//                    p1 = "b - мин (" + b + ")";
//                    p2 = a == c ? "a и c  равны (" + a + ")" : "a - сред (" + a + ")\nc - макс (" + c + ")";
//                }
//            }else{ // a <= b
//                if(a == b) {
//                    p2 = "a и b равны (" + a + ")";
//                    p1 = (c < a) ? "c - мин (" + c + ")\n" + p2 : p2 + "\nс - макс (" + c + ")";
//                    p2 = "";
//                }else{ //a < b
//                    if(c < b){
//                        // с - сред, b - макс
//                        if(c < a){
//                            p1 = "c - мин (" + c + ")";
//                            p2 = "a - сред (" + a + ")";
//                            p3 = "b - макс (" + b + ")";
//                        }else {//c >= a
//                            if (a == c) {
//                                p1 = "a и c  равны (" + a + ")";
//                                p2 = "b - макс (" + b + ")";
//                            }else {//c > a
//                                p1 = "a - мин (" + a + ")";
//                                p2 = "c - сред (" + c + ")";
//                                p3 = "b - макс (" + b + ")";
//                            }
//                        }
//                    }else{// c >= b
//                        if(b == c){
//                            p1 = "a - мин (" + a + ")";
//                            p2 = "b и c равны (" + b + ")";
//                        }else{// b > c
//                            p1 = "a - мин (" + a + ")";
//                            p2 = "b - сред (" + b + ")";
//                            p3 = "c - макс (" + c + ")";
//                        }
//                    }
//                }
//            }
              if(a == b)
                  p1 = c < a ? "c - мин., a и b равны ("+c+", "+a+"="+b+")" : "a и b равны, с - макс. ("+a+"="+b+", "+c+")";
              else if(b == c)
                  p1 = a < b ? "a - мин., b и c равны ("+a+", "+b+"="+c+")" : "b и c равны, a - макс. ("+b+"="+c+", "+a+")";
              else if(a == c)
                  p1 = a > b ? "b - мин., a и c равны ("+b+", "+a+"="+c+")" : "a и c равны, b - макс. ("+a+"="+c+", "+b+")";
              else{
                  if(a < b){
                      if(a < c)
                          p1 = b < c ? "a - мин, b - сред, c - макс ("+a+", "+b+", "+c+")" : "a - мин, c - сред, b - макс ("+a+", "+c+", "+b+")";
                      else
                          p1 = "c - мин, a - сред, b - макс ("+c+", "+a+", "+b+")";
                  }else if(a > c)
                      p1 = b > c ? ("c - мин, b - сред, a - макс ("+c+", "+b+", "+a+")") : ("b - мин, c - сред, a - макс ("+b+", "+c+", "+a+")");
                  else
                      p1 = "b - мин, a - сред, c - макс ("+b+", "+a+", "+c+")";
              }
              //System.out.println(p1+(p2 != "" ? "\n" : "")+p2+(p3 != "" ? "\n" : "")+p3);
              System.out.println(p1);
        }
    }
}